Tekla Open API Reference for Tekla Structures 2025
PluginNameAttribute.Language Property
 Not supported at the moment.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Language { get; }
Public ReadOnly Property Language As String
	Get
Property Value
Type: String
See Also
Reference
PluginNameAttribute Class
Tekla.Structures.Plugins Namespace